{"work":[{"startDate":"2008-11-01","name":"Technical Project Manager at 15below","endDate":"2009-05-01","description":"<br />Secondment to Melbourne to assist in setting up 15below’s first overseas office to support their Asia Pacific clients.<br />Continued support to the UK office providing solutions to complex technical issues on project work there.<br />Project management and requirements gathering for local projects and Australian hours escalation point for the support team."},{"startDate":"2009-05-01","name":"Analyst Developer at 15below","endDate":"2012-06-01","description":"* Secondment to the support team bringing **technical and process experience** as well as being an **escalation point** when the team leader is unavailable. I have helped automate some support tasks, improving team efficiency and reducing the support overhead. Another enjoyable aspect of my role has been in recruiting placement students and a permanent developer to the support team. Then mentoring them as they begin their careers.\n* I also provided **technical input on existing business functionality** to both the design review committee and production change control board. In these responsibilities I aim to maximize the technical debt that can be repaid in new enhancements and to minimize the risk to production in roll out and project go live. This was where I started loving the process of Product Management.\n\nBoth roles allow me to look beyond an immediate task at hand to the wider business and then how we can increase business value. Highlights include:\n* Co-ordinating with the Client Support Team Leader the **update of the reservation system interface** for a US client when their NewSkies system was upgraded to 3.2.\n* Helping to deliver and co-ordinate the **roll out of an enhanced voice solution**, which supported processing through Sabre Reaccommodation Manager, for another US client."},{"startDate":"1998-06-01","name":"Student Trainee at Atkins","endDate":"2000-09-01","description":"**Help Desk Agent/Service Support**\n* As Help Desk Agent my duties included; first line support, configuring and installing new PCs, logging calls and preparing templates for company standard correspondence such as faxes, memos and minutes. Also developing a website for the department's asset management. As part of the Service Support team I was involved in a project that identified any Y2K related problems and prepared the companies financial systems for a successful rollover from 1999 to 2000.\n\n**Developer**\n* Responsibility for planning, implementing and improving various small projects involving an online collaborative system, which included giving a presentation to the client's project managers.\n"},{"startDate":"2000-10-01","name":"Lab Assistant (Technician Grade C) at University of Sussex","endDate":null,"description":"Duties included helping new students familiarise themselves with the Unix terminals and system demonstrations."},{"startDate":"1995-08-01","name":"Technical Support at Network Si Ltd","endDate":null,"description":"On site at Mitsubishi Finance, Broadgate, London.\n\nDuties included creating Microsoft Excel 5 spreadsheets with VBA code for data entry and asset management."},{"startDate":"2005-03-01","name":"Analyst Developer at 15below","endDate":"2008-11-01","description":"* Development of [market leading notification solutions for the travel industry](https://www.youtube.com/watch?v=T0x7xUrLWy8).\n* Porting a core component from **VB6 to VB.NET** including some key enhancements to dynamic content functionality.\n* **Deliverability Consultancy** - using a variety of content, software, white list and DNS methods to improve the rate of emails to reach the inbox.\n* **Technical leadership** on  the design and implementation of solutions for new clients.\n* **Technical leadership and project management** during the implementation and rollout of functionality, e.g. to **increase automation** allowing the reduction of call centre staff and reduction of costs or to increase of revenue via targeted cross selling."},{"startDate":null,"name":"Consultant at Atkins Management Consultants","endDate":null,"description":"* Development of extranets and online collaborative systems to create workflow systems in Business Process Optimisation \n* Research into group awareness in collaborative virtual environments as part of the **Atkins Research and Innovation department**, including EU funded research. For example IST programme *IST-10846 TOWER: Theatre of Work Enabling Relationships*.\n* Part of a team that developed central bespoke portals for the management of programmes of works for both **Shell Oil** and the **Royal Bank of Scotland**. I was specifically responsible for developing a transport ordering B2B solution between a local County Council and Atkins, a system to manage requests to the Atkins Pensions department, and a supplier rating system for Bass Hotels. Other clients included Office of the Rail Regulator, Railtrack, Public Record Office, and the Environment Agency.\n\nPublications:\n**Chalk, N** (2005) “Mining project information using storytelling” in *Proceedings of the 23rd IASTED International Conference on Databases and Applications, Innsbruck, Austria. February 14-16, 2005.* "},{"startDate":"2012-06-01","name":"Configuration Consultant at 15below","endDate":"2013-03-01","description":"Reporting to the Production Services Manager:\n* Plan and **manage client system upgrades**, including analysis and QA.\n* Establish, evolve and document formal upgrade and deployment processes.\n* Act as a **technical consultant to 15below**, supporting all areas of the business.\n* Build and maintain a catalogue of services and configuration information related to those services (Configuration Management Database).\n* Building **knowledge of product and configuration** to assist with establishing baselines and feeding into customer's SLAs and KPIs\n* Act as part of Change Advisory Board.\n* Own Technical Debt Register.\n* Feed customer specific scenarios into QA processes / automated testing"},{"startDate":"2013-04-01","name":"Product Manager at 15below","endDate":null,"description":"* Founder member of Product team at 15below and **creating product processes**\n* Managing the product development budget\n* Report on the Product related objectives in the 15below Business Plan.\n* Working to understand the **business requirements for product specifications** and converting these into use cases.\n* Acts as Product Owner in an agile development team when needed.\n* Providing the Marketing team with the background for case studies, product documentation and [promotional material](https://www.youtube.com/watch?v=T0x7xUrLWy8).\n* Supporting internal processes such as Change Advisory Board, Design Review Committee and Project Standards to ensure that *the &#34;right thing&#34; gets developed &#34;the right way&#34;*.\n* Providing **internal technical consultancy** and business analysis of **airline workflows and reservation system interactions**.\n\nBlog posts for 15below during this time:\n* [Introducing our new user interface: Optimising your notification testing process](https://15below.com/news/view/introducing-our-new-user-interface-optimising-your-notification-testing-pro)\n* [Guest Post: Designing a UI with travel disruption in mind](https://15below.com/news/view/guest-post-designing-a-ui-with-travel-disruption-in-mind)\n* [Guest Blog: Creating operational efficiency with a powerful user interface](https://15below.com/news/view/guest-blog-creating-operational-efficiency-with-a-powerful-user-interface)"}],"basics":{"profiles":[{"username":"http://neilch.blogspot.co.uk","url":"http://neilch.blogspot.co.uk","network":"Blog"},{"username":"neilchalk","url":"https://www.flickr.com/photos/neilchalk","network":"Flickr"},{"username":"@_neilch","url":"https://medium.com/@_neilch","network":"Medium"},{"username":"+NeilChalk","url":"https://plus.google.com/+NeilChalk","network":"GooglePlus"},{"username":"nm3980851","url":"https://www.imdb.com/name/nm3980851","network":"IMDB"},{"username":"neilchalk","url":"https://www.linkedin.com/in/neilchalk","network":"LinkedIn"},{"username":"neilchalk","url":"https://www.github.com/neilchalk","network":"GitHub"},{"username":"_neilch","url":"https://www.twitter.com/_neilch","network":"Twitter"}],"name":"Neil Chalk","email":"neil.chalk@gmail.com"}}